Revit 2024 API
PointLightShape Constructor
 Creates a point light shape object.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public PointLightShape()
Visual Basic
Public Sub New
Visual C++
public:
PointLightShape()
See Also
PointLightShape Class
PointLightShape Overload
Autodesk.Revit.DB.Lighting Namespace